#include <iostream>
using namespace std;
int main(){
	setlocale(LC_ALL, "russian");
	//8. Даны натуральные числа от 20 до 50.Напечатать те из них, которые делятся на 3, но не делятся на 5.
	//int a;
	//for (a = 20; a < 50; a = a + 1) {
	//	if (a % 3 == 0 and a % 5 != 0) {
	//		cout << a << " ";
	//	}
	//}
	//9. даны натуральные числа от 35 до 87. Найти и напечатать те из них, которые при делении на 7 дают остаток 1, 2 или 5.
	//int a;
	//for (a = 35; a < 87; a = a + 1) {
	//	if ((a % 7 == 1) or (a % 7 == 2) or (a % 7 == 5)) {
	//		cout << a << " ";
	//	}
	//}
	//10. Даны натуральные числа от 1 до 50. Найти сумму тех из них, которые делятся на 5 или на 7.
	//int a;
	//int sum = 0;
	//for (a = 1; a < 50; a = a + 1) {
	//	if ((a % 5 == 0) or (a % 7 == 0)) {
	//		sum = sum + a;
	//	}
	//}
	//cout << sum << endl;
	//11. Напечатать те из двузначных чисел которые делятся на 4, но не делятся на 6.
	//int a;
	//for (a = 10; a < 99; a = a + 1) {
	//	if ((a % 4 == 0) and (a % 6 != 0)) {
	//		cout << a << " ";
	//	}
	//}
	//12. Найти произведение двузначных нечетных чисел кратных 13.
	//int a;
	//int pr = 1;
	//for (a = 10; a < 99; a = a + 1) {
	//	if ((a % 2 != 0) and (a % 13 == 0)) {
	//		pr = pr * a;
	//	}
	//}
	//cout << pr << endl;
	//13. Найти сумму чисел от 100 до 200 кратных 17.
	//int a;
	//int sum = 0;
	//for (a = 100; a < 200; a = a + 1) {
	//	if (a % 17 == 0) {
	//		sum = sum + a;
	//	}
	//}
	//cout << sum << endl;
	//14. Составьте программу, которая вычисляет сумму квадратов чисел от 1 до введенного вами целого числа N.
	//int sum = 0;
	//int N;
	//cin >> N;
	//for (int a = 1; a <= N; a = a + 1) {
	//	sum = sum + (a * a);
	//}
	//cout << sum << endl;
	//16. В бригаде, работающей на уборке сена, имеется N сенокосилок.Первая сенокосилка работала m часов, а каждая следующая на 10 минут больше, чем предыдущая.Сколько часов проработала вся бригада?
	//int N, m;
	//cin >> N >> m;
	//for (m = 1; m <= N; m = m + 1) {

	//}
}